app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 31 Aug 2012 03:20:58 UTC +00:00], ["name", "MacBook"], ["price", #<BigDecimal:7fcd651c2f98,'0.17E4',9(18)>], ["updated_at", Fri, 31 Aug 2012 03:20:58 UTC +00:00]]

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "products" SET "price" = 699.0, "updated_at" = '2012-09-24 02:44:06.715657' WHERE "products"."id" = 2